Revit 2027 API
BuiltInFailures.RebarCouplerFailures.NoBarSizeError Property
 This is used to post error. At least Bar Size 1 or Bar Size 2 should have another value than "None".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoBarSizeError { get; }
Public Shared ReadOnly Property NoBarSizeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoBarSizeError {
	FailureDefinitionId^ get ();
}
static member NoBarSizeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace